using System;
using System.Collections.Generic;
using System.Linq;
using System.Text; 

namespace Term2
{
    public partial class Russian
    {
        public static string[] adverbs = GetList(@"data/Russian Adverbs.txt").ToArray();
        public static bool CanBeAdverb(string w)
        {
            return !w.ToLower().EndsWith("ъ");
        }
        

        public static string[,] adverbExeptions = 
        {
            {"гордо",        "более гордо",     "наиболее гордо",}, 
            {"легко",        "легче",           "легче всего",   },
            {"ярко",         "ярче",            "ярче всего",    },
            {"широко",       "шире",            "шире всего",    },
            {"хорошо",       "лучше",           "лучше всего",   },
            {"твердо",       "тверже",          "тверже всего",  },
            {"строго",       "строже",          "строже всего",  },
            {"редко",        "реже",            "реже всего",    },
            {"резко",        "резче",           "резче всего",   },
            {"круто",        "круче",           "круче всего",   },
            {"крепко",       "крепче",          "крепче всего",  }, 
            {"глубоко",      "глубже",          "глубже всего"   },
            {"бойко",        "бойче",           "бойче всего",   },
            {"жестко",       "жестче",          "наиболее жестко"},
            {"жарко",        "жарче",           "жарче всего",   },
            {"мало",         "меньше",          "меньше всего",  },
            {"много",        "больше",          "больше всего",  },
            {"богато",       "богаче",          "богаче всего",  },
            {"дешего",       "дешевле",         "дешевле всего", },
            {"тонко",        "тоньше",          "тоньше всего",  },
            {"плохо",        "хуже",            "хуже всего",    },
            {"далеко",       "дальше",          "дальше всего",  },
            {"близко",       "ближе",           "ближе всего",   },
            {"узко",         "уже",             "уже всего",     },
            {"молодо",       "моложе",          "моложе всего",  },
            {"горько",       "горше",           "горше всего",   },
            {"сухо",         "суше",            "суше всего",    },
            {"сладко",       "слаще",           "слаще всего",   },
            {"четко",        "четче",           "четче всего",   },
            {"гадко",        "гаже",            "гаже всего",    },
            {"дорого",       "дороже",          "дороже всего",  },
            {"тихо",         "тише",            "тише всего",    },
            {"близко",       "ближе",           "ближе всего",   },
            {"долго",        "дольше",          "дольше всего",  },
            {"тонко",        "тоньше",          "тоньше всего",  },
            {"низко",        "ниже",            "ниже всего",    },
            {"рано",         "раньше",          "раньше всего",  },
            {"часто",        "чаще",            "чаще всего",    },
            {"просто",       "проще",           "проще всего",   },
                                                     
            {"мелко",           "мельче",           "мельче всего",       },
            {"звонко",          "звонче",           "звонче всего",       },
            {"творчески",       "более творчески",  "наиболее творчески", },
            {"высоко",          "выше",             "выше всего",         },
            {"автоматически",   "автоматичнее",     ""                    },
            {"героически",      "героичнее",        ""                    },
            {"горько",          "горше",            "наиболее горько",    },
            {"густо",           "гуще",             "наиболее густо",     },
            {"полого",          "более полого",     "наиболее полого",    },
            {"толсто",          "толще",            "наиболее толсто",    },
            {"жутко",           "более жутко",      "наиболее жутко",     },
            {"громко",          "громче",           "наиболее громко",    },
            {"дешево",          "дешевле",          "наиболее дешево",    },
            {"мягко",           "мягче",            "наиболее мягко",     },
            {"мокро",           "более мокро",      "наиболее мокро",     },
            {"глухо",           "более глухо",      "наиболее глухо",     },
            {"жидко",           "более жидко",      "наиболее жидко",     },
            {"тускло",          "более тускло",     "наиболее тускло",    },
            {"рьяно",           "более рьяно",      "наиболее рьяно",     },
            {"тяжко",           "более тяжко",      "наиболее тяжко",     },
            {"страстно",        "более страстно",   "наиболее страстно",  },
            {"чисто",           "чище",             "наиболее чисто",     },


            {"туго",      "туже",      "туже всего",   },
            {"веско",     "весче",     "весче всего",  } ,
            {"броско",     "бросче",     "бросче всего",  } ,
            {"гулко",     "гулче",     "наиболее гулко",  } , 
            {"жалко","жальче","жальче всего"},
            {"пылко","пыльче","пыльче всего"},
            {"скользко","скользче","скользче всего"},
            {"дерзко",     "более дерзко",     "наиболее дерзко",  },
            {"нервно","более нервно","наиболее нервно"},
            

            
            {"направо",           "правее",             "правее всего",     },
            {"налево",           "левее",             "левее всего",     },
            {"вправо",           "правее",             "правее всего",     },
            {"влево",           "левее",             "левее всего",     },
            {"коротко",           "короче",             "короче всего",     }, 
        };
        public static List<string> adverbExeptionsNoForm = new List<string>()
        {
            "бесконечно", "безгранично", "бурно", "абсолютно", "баснословно", 
            "беззаветно", "беззастенчиво", "безмерно", "безоговорочно", 
            "безраздельно", "безукоризненно", "безусловно", "безустанно", 
            "безповоротно", "безпрекословно", "бесследно", "бесчеловечно", 
            "ладно", "всемирно", "вовсю",  "дико", "досконально", //"горько",
            "дьявольски", "жгуче", "железно", "жестоко", "зверски",  "злостно", 
            "излишне", "изрядно", "исключительно", "истово", "исчерпывающе", 
            "катастрофически", "всячески", "мертвецки", "панически", 
            "патологически", "чертовски", "клятвенно", "колоссально", "крайне", 
            "кристально", "кровно", "люто", "максимально", "навзрыд", "наглухо", 
            "наголову", "надрывно", "назубок", "намертво", "наотрез", "напрочь", 
            "нарочито", "насквозь", "настоятельно", "начисто", "небывало", 
            "неизмеримо", "неописуемо", "непримиримо", "непробудно", 
            "несказанно", "несравненно", "неузноваемо", "неустанно", "неутомимо", 
            "неутолимо", "оглушительно", "открыто", "очень", "пламенно", 
            "подлинно", "подчеркнуто", "позарез", "поистине", "полностью", 
            "порядком", "потрясающе", "предельно", "рекордно", "свято", "совсем", 
            "ужасающе", "феноменально", "хорошенько", "шумно", "наглухо", 
            "сахарно","нарочно","бегло", "вечно", "пусто"
        };

        public static string Adverb(string w_neutral, Russian.Form f)
        {
            if (adverbExeptionsNoForm.Contains(w_neutral)) return _noform;
            if (f == Form.None) return w_neutral;
            w_neutral = w_neutral.ToLower();

            bool is_inverse = false;
            string wbase2 = w_neutral;
            if (w_neutral.StartsWith("не"))
            {
                is_inverse = true;
                wbase2 = w_neutral.Substring(2);
            } 
            if (w_neutral.StartsWith("по") && w_neutral.EndsWith("у")) return _noform;
            if (w_neutral.EndsWith("ь")) return _noform;
            if (w_neutral.EndsWith("а")) return _noform;
            if (w_neutral.EndsWith("у")) return _noform; 

            if (!w_neutral.EndsWith("о", "е", "и")) return _noform;


            for (int i = 0; i < adverbExeptions.GetLength(0); i++)
            {
                if (adverbExeptions[i, 0] == w_neutral)
                {
                    string r = f == Form.Comparative ? adverbExeptions[i, 1] : adverbExeptions[i, 2];
                    if (r == "") return "";
                    else return r;
                }
                else if (is_inverse && adverbExeptions[i, 0] == w_neutral.Substring(2))
                {
                    string r = f == Form.Comparative ? adverbExeptions[i, 1] : adverbExeptions[i, 2];
                    if (r == "") return "";
                    if (r.Contains("наиболее") || r.Contains("более"))
                    {
                        r = r.Replace("наиболее", "наименее").Replace("более", "менее");
                    }
                    else
                    { 
                        r = "не" + r;
                    }

                    return r; 
                }
            }

            char last = w_neutral.Last();
            string last3 = w_neutral.Last(3);
            if (last3 == "око" || last3 == "ски")
            {
                if (f == Form.Superlative) return (is_inverse ? "наименее " : "наиболее ") + wbase2;
                else return (is_inverse ? "менее " : "более ") + w_neutral;
            }
            if(w_neutral.EndsWith("ко"))
            {
                string basen = w_neutral.Till(2);
                string basew = wbase2.Till(2);
                if (f == Form.Superlative) return (!is_inverse ? basew : basen) + "че всего";
                else return (!is_inverse ? basew : basen) + "че";
            }
            else if (last == 'о')
            {
                string basen = w_neutral.Till(1);
                string basew = wbase2.Till(1);
                if (f == Form.Superlative) return (!is_inverse ? basew : basen) + "ее всего";
                else return (!is_inverse ? basew : basen) + "ее";
            }


            return w_neutral;
        }
         
    }
}
